using Microsoft.EntityFrameworkCore.Migrations;

#nullable disable

#pragma warning disable CA1814 // Prefer jagged arrays over multidimensional

namespace KouintaBooksApp.Migrations
{
    /// <inheritdoc />
    public partial class InitialData : Migration
    {
        /// <inheritdoc />
        protected override void Up(MigrationBuilder migrationBuilder)
        {
            migrationBuilder.CreateTable(
                name: "KouintaBooks",
                columns: table => new
                {
                    BookID = table.Column<int>(type: "int", nullable: false)
                        .Annotation("SqlServer:Identity", "1, 1"),
                    bookTitle = table.Column<string>(type: "nvarchar(max)", nullable: false),
                    publisherName = table.Column<string>(type: "nvarchar(max)", nullable: false),
                    bookYear = table.Column<int>(type: "int", nullable: false),
                    bookPriceWVatND = table.Column<float>(type: "real", nullable: false),
                    finalBookPriceNoVat = table.Column<float>(type: "real", nullable: false),
                    finalBookPrice = table.Column<float>(type: "real", nullable: false),
                    ISBN = table.Column<string>(type: "nvarchar(max)", nullable: false)
                },
                constraints: table =>
                {
                    table.PrimaryKey("PK_KouintaBooks", x => x.BookID);
                });

            migrationBuilder.InsertData(
                table: "KouintaBooks",
                columns: new[] { "BookID", "ISBN", "bookPriceWVatND", "bookTitle", "bookYear", "finalBookPrice", "finalBookPriceNoVat", "publisherName" },
                values: new object[,]
                {
                    { 1, "978-618-80515-1-5", 12f, "Μετά το γιώτα της ίωσης", 2013, 8.4f, 7.92f, "Τσοτάκος, Σπύρος" },
                    { 2, "978-618-80515-0-8", 12f, "Τα πλήθη του ενός", 2013, 8.4f, 7.92f, "Τσέχος, Ηλίας" },
                    { 3, "978-618-80515-3-9", 22f, "Εισαγωγή στον κινηματογράφο", 2014, 15.4f, 14.53f, "Χρηστος Καρακάσης" },
                    { 4, "978-618-80515-4-6", 15f, "Take a Trip to the Invisible Cities", 2014, 10.5f, 9.91f, "Κάππα, Βασιλική" },
                    { 5, "978-618-80515-2-2", 8f, "The Girlfriend", 2014, 5.6f, 5.28f, "Kelly, Tim" },
                    { 6, "978-618-80515-5-3", 7f, "Διεθνές Φεστιβάλ Ψηφιακού Κινηματογράφου", 2014, 4.9f, 4.62f, "-" },
                    { 7, "978-618-82109-0-5", 12f, "Eleni's Poetic Stories", 2015, 8.4f, 7.92f, "Ζόχντη - Μπλέτση, Ελένη" },
                    { 8, "978-618-80515-9-1", 17f, "Ήταν ένα Μικρό Τσαρούχι", 2015, 11.9f, 11.23f, "Βαρσάμης, Δημήτρης" },
                    { 9, "978-618-80515-7-7", 12f, "Ένα αστέρι στη Γη", 2015, 8.4f, 7.92f, "Λιτσοπούλου, Μαρία" },
                    { 10, "978-618-80515-8-4", 12f, "Η θυσία", 2015, 8.4f, 7.92f, "Μαρή Στέλλα" },
                    { 11, "978-618-80515-6-0", 15f, "Ρεμπέτικη ραψωδία", 2015, 10.5f, 9.91f, "Γκουζιώτης, Δημήτρης" },
                    { 12, "978-618-82109-1-2", 20f, "Οι παλιοί κινηματογράφοι της Αθήνας", 2015, 14f, 13.21f, "Θεοδοσίου, Νίκος" },
                    { 13, "978-618-82109-6-7", 14f, "Φωταύγεια ", 2016, 9.8f, 9.25f, "Χρηστος Καρακάσης" },
                    { 14, "978-618-82109-8-1", 14f, "Σε Χρώμα Κόκκινο", 2016, 9.8f, 9.25f, "Καλουμένου Άρτεμις" },
                    { 15, "978-618-82109-9-8", 14f, "Οι χορευτές των φαναριών", 2016, 9.8f, 9.25f, "Κάππα Βασιλική" },
                    { 16, "978-618-82109-7-4", 14f, "Ρέπλικα", 2016, 9.8f, 9.25f, "Μαρή Στέλλα" },
                    { 17, "978-618-82109-5-0", 12f, "Οι ποιητικές ιστορίες", 2016, 8.4f, 7.92f, "Ζόχντη - Μπλέτση, Ελένη" },
                    { 18, "978-618-82109-2-9", 12f, "ΤΟ ΤΑΞΙΔΙ ΜΟΛΙΣ ΤΩΡΑ ΑΡΧΙΖΕΙ ", 2016, 8.4f, 7.92f, "Συλλογικό έργο" },
                    { 19, "978-618-82109-3-6", 15f, "Το Μαύρο Αλφαβητάρι της Μουσικής", 2016, 10.5f, 9.91f, "Περιστέρης, Φίλιππος" },
                    { 20, "978-618-5268-00-8", 14f, "Οι γάτες της Αφρικής", 2016, 9.8f, 9.25f, "Πέτρου Μαρία" },
                    { 21, "978-618-82109-4-3", 12f, "The Duchess", 2016, 8.4f, 7.92f, "Kelly, Tim" },
                    { 22, "978-618-5268-01-5", 14f, "Ανυποχώρητοι έρωτες", 2017, 9.8f, 9.25f, "Καρτέρης Γιάννης" },
                    { 23, "978-618-5268-02-2", 14f, "Ανθρώπινο Τσίρκο", 2017, 9.8f, 9.25f, "Καϊμάκη Κέλλυ" },
                    { 24, "978-618-5268-03-9", 14f, "Ο πλανήτης", 2017, 9.8f, 9.25f, "Μαρή Στέλλα" },
                    { 25, "978-618-5268-04-6", 14f, "Η μετακόμιση", 2017, 9.8f, 9.25f, "Χρηστος Καρακάσης" },
                    { 26, "978-618-5268-05-3", 15f, "Ψαλμός στη σιωπή", 2018, 10.5f, 9.91f, "Τριανταφυλλίδη, Νίκη" },
                    { 27, "978-618-5268-06-0", 14f, "Ποιητική Συλλογή μῆτις", 2018, 9.8f, 9.25f, "Χρηστος Καρακάσης" },
                    { 28, "978-618-5268-07-7", 12f, "Ο ευτυχισμένος πρίγκιπας", 2018, 8.4f, 7.92f, "Wilde, Oscar, 1854-1900" },
                    { 29, "978-618-5268-08-4", 14f, "Στιγμές που εκβάλλουν στο αιώνιο", 2021, 9.8f, 9.25f, "Μπούσιος, Ηλίας" },
                    { 30, "978-618-5268-09-1", 12f, "Και να θυμάσαι", 2021, 8.4f, 7.92f, "Θυμιανού, Αλεξάνδρα Ι." },
                    { 31, "978-618-5268-10-7", 14f, "Ροές ψυχής", 2022, 9.8f, 9.25f, "Μπούσιος, Ηλίας" },
                    { 32, "978-618-5268-11-4", 14f, "Λοιπόν; Τι σκέφτεστε;", 2023, 9.8f, 9.25f, "Θυμιανού, Αλεξάνδρα Ι." },
                    { 33, "978-618-5268-12-1", 18f, "Όλα για την Ελίζα", 2023, 12.6f, 11.89f, "Κυριακάκη, Μαριάννα" },
                    { 34, "978-618-5268-13-8", 14f, "Βαλς κάρδαμου κανέλας", 2023, 9.8f, 9.25f, "Παυλιδάκη, Μαίρη" },
                    { 35, "978-618-5268-15-2", 20f, "Στα χνάρια του Φεδερίκο Γκαρθία Λόρκα", 2023, 14f, 13.21f, "Μπούσιος, Ηλίας" },
                    { 36, "978-618-5268-14-5", 18f, "Η αρπαγή του φεγγαριού", 2023, 12.6f, 11.89f, "Ανωγειάτης, Γιώργος" }
                });
        }

        /// <inheritdoc />
        protected override void Down(MigrationBuilder migrationBuilder)
        {
            migrationBuilder.DropTable(
                name: "KouintaBooks");
        }
    }
}
